// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

int a = 2;
int b = 3;
int c = 7;
if (b < a > c) ;
{
    Console.WriteLine("{0} максимальное число", a);
}
else if (a < b > c)
{
    Console.WriteLine("{0} максимальное число", b);
}
else if (a < c > b)
{
    Console.WriteLine("{0} максимальное число ", с);
}

int a = 2;
int b = 3;
int c = 7;
Mmax = a
if (a > b) ;
{
    Console.WriteLine("{0} максимальное число", a);
}
else
{
    Console.WriteLine("{0} максимальное число", b);
}
if (c > максимальное число);
{
    Console.WriteLine("{0} максимальное число ", с);
}